api-management/apis/legacy-catalog-soap-api_v1CSAM4I/operations/POST___soapAction=http___t1NLRU69.request.text_xml.html

<?xml version="1.0" encoding="utf-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <RemoveCatalogItem xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://tempuri.org/">
      <catalogItem>
        <CatalogBrand xmlns="http://schemas.datacontract.org/2004/07/eShopWCFService.Models">
          <Brand>Brand1</Brand>
          <Id>1</Id>
        </CatalogBrand>
        <CatalogBrandId xmlns="http://schemas.datacontract.org/2004/07/eShopWCFService.Models">1</CatalogBrandId>
        <CatalogType xmlns="http://schemas.datacontract.org/2004/07/eShopWCFService.Models">
          <Id>1</Id>
          <Type>Type1</Type>
        </CatalogType>
        <CatalogTypeId xmlns="http://schemas.datacontract.org/2004/07/eShopWCFService.Models">1</CatalogTypeId>
        <Description xmlns="http://schemas.datacontract.org/2004/07/eShopWCFService.Models">Description1</Description>
        <Id xmlns="http://schemas.datacontract.org/2004/07/eShopWCFService.Models">1</Id>
        <Name xmlns="http://schemas.datacontract.org/2004/07/eShopWCFService.Models">Name1</Name>
        <Picturefilename xmlns="http://schemas.datacontract.org/2004/07/eShopWCFService.Models">Picturefilename1</Picturefilename>
        <Price xmlns="http://schemas.datacontract.org/2004/07/eShopWCFService.Models">1</Price>
      </catalogItem>
    </RemoveCatalogItem>
  </Body>
</Envelope>